In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('E:\\python_data\\Weather.csv')
print(df)

          datetime_utc  _conds   _dewptm   _fog   _hail   _heatindexm   _hum  \
0       19961101-11:00   Smoke       9.0      0       0           NaN   27.0
1       19961101-12:00   Smoke      10.0      0       0           NaN   32.0
2       19961101-13:00   Smoke      11.0      0       0           NaN   44.0
3       19961101-14:00   Smoke      10.0      0       0           NaN   41.0
4       19961101-16:00   Smoke      11.0      0       0           NaN   47.0
...                ...     ...       ...    ...     ...           ...    ...
100985  20170424-06:00    Haze      17.0      0       0           NaN   25.0
100986  20170424-09:00    Haze      14.0      0       0           NaN   16.0
100987  20170424-12:00    Haze      12.0      0       0           NaN   14.0
100988  20170424-15:00    Haze      15.0      0       0           NaN   27.0
100989  20170424-18:00    Haze      15.0      0       0           NaN   30.0

         _precipm   _pressurem   _rain   _snow   _tempm   _thunder   _tornado  \
0             NaN       1010.0       0       0     30.0          0          0
1             NaN      -9999.0       0       0     28.0          0          0
2             NaN      -9999.0       0       0     24.0          0          0
3             NaN       1010.0       0       0     24.0          0          0
4             NaN       1011.0       0       0     23.0          0          0
...           ...          ...     ...     ...      ...        ...        ...
100985        NaN       1005.0       0       0     34.0          0          0
100986        NaN       1003.0       0       0     38.0          0          0
100987        NaN       1002.0       0       0     36.0          0          0
100988        NaN       1004.0       0       0     32.0          0          0
100989        NaN       1005.0       0       0     30.0          0          0

         _vism   _wdird  _wdire   _wgustm   _windchillm   _wspdm
0          5.0    280.0    West       NaN           NaN      7.4
1          NaN      0.0   North       NaN           NaN      NaN
2          NaN      0.0   North       NaN           NaN      NaN
3          2.0      0.0   North       NaN           NaN      NaN
4          1.2      0.0   North       NaN           NaN      0.0
...        ...      ...     ...       ...           ...      ...
100985     4.0    320.0      NW       NaN           NaN     11.1
100986     4.0    320.0      NW       NaN           NaN     22.2
100987     4.0    270.0    West       NaN           NaN     18.5
100988     2.0    320.0      NW       NaN           NaN      3.7
100989     2.0    320.0      NW       NaN           NaN      3.7

[100990 rows x 20 columns]

In [3]:
df=pd.read_csv('E:\\python_data\\Weather.csv')

In [4]:
df

,datetime_utc,_conds,_dewptm,_fog,_hail,_heatindexm,_hum,_precipm,_pressurem,_rain,_snow,_tempm,_thunder,_tornado,_vism,_wdird,_wdire,_wgustm,_windchillm,_wspdm
0,19961101-11:00,Smoke,9.0,0,0,NaN,27.0,NaN,1010.0,0,0,30.0,0,0,5.0,280.0,West,NaN,NaN,7.4
1,19961101-12:00,Smoke,10.0,0,0,NaN,32.0,NaN,-9999.0,0,0,28.0,0,0,NaN,0.0,North,NaN,NaN,NaN
2,19961101-13:00,Smoke,11.0,0,0,NaN,44.0,NaN,-9999.0,0,0,24.0,0,0,NaN,0.0,North,NaN,NaN,NaN
3,19961101-14:00,Smoke,10.0,0,0,NaN,41.0,NaN,1010.0,0,0,24.0,0,0,2.0,0.0,North,NaN,NaN,NaN
4,19961101-16:00,Smoke,11.0,0,0,NaN,47.0,NaN,1011.0,0,0,23.0,0,0,1.2,0.0,North,NaN,NaN,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
100985,20170424-06:00,Haze,17.0,0,0,NaN,25.0,NaN,1005.0,0,0,34.0,0,0,4.0,320.0,NW,NaN,NaN,11.1
100986,20170424-09:00,Haze,14.0,0,0,NaN,16.0,NaN,1003.0,0,0,38.0,0,0,4.0,320.0,NW,NaN,NaN,22.2
100987,20170424-12:00,Haze,12.0,0,0,NaN,14.0,NaN,1002.0,0,0,36.0,0,0,4.0,270.0,West,NaN,NaN,18.5
100988,20170424-15:00,Haze,15.0,0,0,NaN,27.0,NaN,1004.0,0,0,32.0,0,0,2.0,320.0,NW,NaN,NaN,3.7
100989,20170424-18:00,Haze,15.0,0,0,NaN,30.0,NaN,1005.0,0,0,30.0,0,0,2.0,320.0,NW,NaN,NaN,3.7

In [5]:
df['_tempm'].max()

KeyError: '_tempm'

In [ ]:
df.head(5)

In [ ]:
dic = {
    "name":['krutarth','vidhi','aayu','meet'],
    "mark":[91,81,71,72],
    "city":['A','A','L','S']
}
df=pd.DataFrame(dic)

In [ ]:
df

In [ ]:
df.to_csv("brother.csv")

In [ ]:
df.head(2)

In [ ]:
df.tail(2)

In [ ]:
df.describe()

In [ ]:
df['mark'][0]

In [7]:
new=pd.Series(np.random.rand(30))
new

0     0.499971
1     0.938962
2     0.952446
3     0.165894
4     0.577594
5     0.554610
6     0.969965
7     0.230204
8     0.129329
9     0.592716
10    0.189215
11    0.253384
12    0.622584
13    0.873709
14    0.661512
15    0.948118
16    0.614249
17    0.509326
18    0.122001
19    0.040734
20    0.508780
21    0.864176
22    0.330393
23    0.073742
24    0.989129
25    0.229212
26    0.307953
27    0.531168
28    0.874573
29    0.198833
dtype: float64

In [8]:
type(new)

pandas.core.series.Series

In [9]:
df.dtypes

datetime_utc     object
 _conds          object
 _dewptm        float64
 _fog             int64
 _hail            int64
 _heatindexm    float64
 _hum           float64
 _precipm       float64
 _pressurem     float64
 _rain            int64
 _snow            int64
 _tempm         float64
 _thunder         int64
 _tornado         int64
 _vism          float64
 _wdird         float64
 _wdire          object
 _wgustm        float64
 _windchillm    float64
 _wspdm         float64
dtype: object

In [10]:
df.head()

,datetime_utc,_conds,_dewptm,_fog,_hail,_heatindexm,_hum,_precipm,_pressurem,_rain,_snow,_tempm,_thunder,_tornado,_vism,_wdird,_wdire,_wgustm,_windchillm,_wspdm
0,19961101-11:00,Smoke,9.0,0,0,NaN,27.0,NaN,1010.0,0,0,30.0,0,0,5.0,280.0,West,NaN,NaN,7.4
1,19961101-12:00,Smoke,10.0,0,0,NaN,32.0,NaN,-9999.0,0,0,28.0,0,0,NaN,0.0,North,NaN,NaN,NaN
2,19961101-13:00,Smoke,11.0,0,0,NaN,44.0,NaN,-9999.0,0,0,24.0,0,0,NaN,0.0,North,NaN,NaN,NaN
3,19961101-14:00,Smoke,10.0,0,0,NaN,41.0,NaN,1010.0,0,0,24.0,0,0,2.0,0.0,North,NaN,NaN,NaN
4,19961101-16:00,Smoke,11.0,0,0,NaN,47.0,NaN,1011.0,0,0,23.0,0,0,1.2,0.0,North,NaN,NaN,0.0

In [11]:
df=pd.read_csv('brother.csv')

In [12]:
df

   Unnamed: 0      name  mark city
0           0  krutarth    91    A
1           1     vidhi    81    A
2           2      aayu    71    L
3           3      meet    72    S

In [13]:
df.T

                   0      1     2     3
Unnamed: 0         0      1     2     3
name        krutarth  vidhi  aayu  meet
mark              91     81    71    72
city               A      A     L     S

In [15]:
df.sort_index(axis=1,ascending=False)

       name  mark city  Unnamed: 0
0  krutarth    91    A           0
1     vidhi    81    A           1
2      aayu    71    L           2
3      meet    72    S           3

In [16]:
df

   Unnamed: 0      name  mark city
0           0  krutarth    91    A
1           1     vidhi    81    A
2           2      aayu    71    L
3           3      meet    72    S

In [20]:
df.drop('city',axis=1)

   Unnamed: 0      name  mark
0           0  krutarth    91
1           1     vidhi    81
2           2      aayu    71
3           3      meet    72

In [21]:
df

   Unnamed: 0      name  mark city
0           0  krutarth    91    A
1           1     vidhi    81    A
2           2      aayu    71    L
3           3      meet    72    S

In [24]:
df.loc[[1,2],['name','mark']]

    name  mark
1  vidhi    81
2   aayu    71

In [25]:
df.loc[[1,2],:]

   Unnamed: 0   name  mark city
1           1  vidhi    81    A
2           2   aayu    71    L

In [26]:
df.loc[:,['name','mark']]

       name  mark
0  krutarth    91
1     vidhi    81
2      aayu    71
3      meet    72

In [28]:
df.loc[df['mark']>80]

   Unnamed: 0      name  mark city
0           0  krutarth    91    A
1           1     vidhi    81    A

In [29]:
df[2:5]

   Unnamed: 0  name  mark city
2           2  aayu    71    L
3           3  meet    72    S

In [30]:
df[2:]

   Unnamed: 0  name  mark city
2           2  aayu    71    L
3           3  meet    72    S

In [31]:
df[:-1]

   Unnamed: 0      name  mark city
0           0  krutarth    91    A
1           1     vidhi    81    A
2           2      aayu    71    L

In [32]:
df[:]

   Unnamed: 0      name  mark city
0           0  krutarth    91    A
1           1     vidhi    81    A
2           2      aayu    71    L
3           3      meet    72    S

In [33]:
df.name

0    krutarth
1       vidhi
2        aayu
3        meet
Name: name, dtype: object

In [36]:
df[['name','mark']]

       name  mark
0  krutarth    91
1     vidhi    81
2      aayu    71
3      meet    72

In [37]:
df['mark'].max()

91

In [39]:
df['mark'].describe()

count     4.000000
mean     78.750000
std       9.322911
min      71.000000
25%      71.750000
50%      76.500000
75%      83.500000
max      91.000000
Name: mark, dtype: float64

In [42]:
df['mark'].median()

76.5

In [43]:
df

   Unnamed: 0      name  mark city
0           0  krutarth    91    A
1           1     vidhi    81    A
2           2      aayu    71    L
3           3      meet    72    S

In [2]:
g=df.groupby('city')

NameError: name 'df' is not defined

In [45]:
g

In [46]:
for c,ci in g:
    print(c)
    print(ci)

A
   Unnamed: 0      name  mark city
0           0  krutarth    91    A
1           1     vidhi    81    A
L
   Unnamed: 0  name  mark city
2           2  aayu    71    L
S
   Unnamed: 0  name  mark city
3           3  meet    72    S

In [47]:
for c in g:
    print(c)
    #print(ci)

('A',    Unnamed: 0      name  mark city
0           0  krutarth    91    A
1           1     vidhi    81    A)
('L',    Unnamed: 0  name  mark city
2           2  aayu    71    L)
('S',    Unnamed: 0  name  mark city
3           3  meet    72    S)

In [48]:
df

   Unnamed: 0      name  mark city
0           0  krutarth    91    A
1           1     vidhi    81    A
2           2      aayu    71    L
3           3      meet    72    S

In [49]:
df['name']

0    krutarth
1       vidhi
2        aayu
3        meet
Name: name, dtype: object